{
    "homeTexts": [
        {
            "title": "Carrotour",
            "description": "A grid-based puzzle game where you utilize various \"leaper\" movements to navigate around obstacles and grab delicious carrots. Be a horse, camel, elephant or rabbit! Also, be prepared for intense boss battles featuring bullet hells!"
        },
        {
            "title": "Carrotour 邏蔔巡蘿",
            "description": "是一款棋盤方格解謎遊戲，玩家要利用各種特殊的走法在棋盤上移動，避開障礙，並吃到美味的蘿蔔。馬、駱駝、象、兔子，全都有不同的走法！此外，準備好迎接充滿彈幕的激烈魔王戰！"
        },
        {
            "title": "Carrotour 逻卜巡萝",
            "description": "是一款棋盘方格解谜游戏，玩家要利用各种特殊的走法在棋盘上移动，避开障碍，并吃到美味的萝卜。马、骆驼、象、兔子，全都有不同的走法！此外，准备好迎接充满弹幕的激烈魔王战！"
        },
        {
            "title": "Carrotour",
            "description": "さまざまな「リーパー」の動きを活用して障害物を避けながら、おいしいニンジンを集めるグリッド移動のパズルゲームです。ウマ、ラクダ、ゾウなど、いろいろな動物にも変身！さらに、白熱の弾幕ボス戦にも備えてください！"
        }
    ],
    "carouselTexts": [
        [
            {
                "title": "Unfamiliar Leaper Movements",
                "description": "In this game, you don't just move up, down, left and right! Instead, you move as \"leapers\". They move in a specific angle about an axis, a fixed distance each time, and cannot be blocked. Think about the knight in chess, which is a classic leaper! Getting use to the move patterns is the key to victory."
            },
            {
                "title": "Fun Traps and Items",
                "description": "On the map of each level, all kinds of traps and items are waiting for you. We got spikes, portals, crates, springs and many more! They interact with each other in unique ways. Understand and use them to your advantage!"
            },
            {
                "title": "Intense Boss Fights",
                "description": "Want some different experience? Behold, boss fights! In boss levels, you don't have to carefully come up with a solution to a puzzle. What you have to do is dodge the boss's rapid attacks, and grab carrots to strike back!"
            }
        ],
        [
            {
                "title": "特殊的移動方式",
                "description": "在此遊戲中，你不只會上、下、左、右，而是會用一種特別的方式移動。每次移動會和水平線或鉛直線形成一個特定的角度，距離固定，且不會被阻擋，就好像象棋中的馬一樣，只不過沒有拐馬腳！熟悉這些移動的特性是勝利的關鍵。"
            },
            {
                "title": "有趣的陷阱和機關",
                "description": "在每個關卡中，有許多陷阱和機關在等待著你。除了尖刺、傳送門、箱子、彈簧以外，還有許多精彩！而且各種機關之間會有獨特的互動關係，只要理解它們，就能善用它們！"
            },
            {
                "title": "緊張刺激的魔王戰",
                "description": "想要新鮮的體驗嗎？那一定不能忘了魔王戰！在魔王關中，你不需要仔細思考謎題的解答。你要做的，是躲避魔王的快速攻擊，並吃到蘿蔔以發動反擊！"
            }
        ],
        [
            {
                "title": "特殊的移动方式",
                "description": "在此游戏中，你不只会上、下、左、右，而是会用一种特别的方式移动。每次移动会和水平线或铅直线形成一个特定的角度，距离固定，且不会被阻挡，就好像象棋中的马一样，只不过没有拐马脚！熟悉这些移动的特性是胜利的关键。"
            },
            {
                "title": "有趣的陷阱和机关",
                "description": "在每个关卡中，有许多陷阱和机关在等待着你。除了尖刺、传送门、箱子、弹簧以外，还有许多精彩！而且各种机关之间会有独特的互动关系，只要理解它们，就能善用它们！"
            },
            {
                "title": "紧张刺激的魔王战",
                "description": "想要新鲜的体验吗？那一定不能忘了魔王战！在魔王关中，你不需要仔细思考谜题的解答。你要做的，是躲避魔王的快速攻击，并吃到萝卜以发动反击！"
            }
        ],
        [
            {
                "title": "見慣れない「チェスのリーパー」の動き",
                "description": "このゲームでは、単に上下左右に動くだけではない！代わりに、「リーパー」（Leaper）として移動する。リーパーは、特定の動きでジャンプする、遮られることのない駒を指す。チェスのナイトはリーパーの典型例だ！移動パターンに慣れることが勝利への鍵となる。"
            },
            {
                "title": "楽しいトラップとアイテム",
                "description": "各レベルには、いろいろなトラップとアイテムが待っている。トゲ、ポータル、木箱、バネなど、まだまだたくさん！それらは独特な方法で相互作用する。それらを理解し、自分の有利になるように利用しよう！"
            },
            {
                "title": "白熱のボス戦",
                "description": "いつもと違う体験がしたい？さあ、ボス戦だ！ボスレベルでは、パズルの解答を慎重に考える必要はない。ボスの素早い攻撃を回避し、ニンジンを集めて反撃しよう！"
            }
        ]
    ],
    "characterNameList": [
        ["Leappa", "Leappa (horse)", "Leappa (camel)", "Leappa (elephant)", "Humel", "Alphil", "???"],
        ["立啪", "立啪\n（馬）", "立啪\n（駱駝）", "立啪\n（象）", "瀚漠", "奡飛", "？？？"],
        ["立啪", "立啪\n（马）", "立啪\n（骆驼）", "立啪\n（象）", "瀚漠", "奡飞", "？？？"],
        ["リーッパ", "リーッパ\n（ウマ）", "リーッパ\n（ラクダ）", "リーッパ\n（ゾウ）", "ハンメル", "アルフィル", "？？？"]
    ],
    "characterDescriptionList": [
        ["A curious and naughty rabbit, and a student of a local wizard school. Despite being a wizard, Leappa is really bad at magic, so bad that he failed the most basic magic class 3 times. However, Leappa is good at eating carrots, leaping around and solving puzzles... maybe.",
         "Leappa after getting turned into a horse. Moves like this: {1x2move.webp}",
         "Leappa after getting turned into a camel. Moves like this: {1x3move.webp}",
         "Leappa after getting turned into an elephant. Moves like this: {2x2move.webp}",
         "A serious and dilligent camel. In the past, Humel ate some carrots out of hunger, without permission. To pay for that, Humel has to work for the owner of those carrots, but he does not complain, and strives to do his best at the job.",
         "An elephant that's a bit lazy and silly. Alphil works for his boss because that's the only job he could find, and he needed one. Alphil always wants to be paid better, despite putting minimum effort into his job. It won't be a surprise if he gets fired...",
         "This is the owner of the carrot field, and Humel and Alphil's boss. Old and grumpy, he is a high level wizard, who built an enormous underground maze. He keeps hiring new employees to work for him, yet nobody understands his goal... as well as the solutions to his maze."],
        ["立啪是隻富有好奇心又頑皮的兔子，同時也是地方巫師學校的學生。雖然是巫師，魔法卻很爛，爛到連最基本的魔法課程都被當了3次。不過，立啪很擅長吃蘿蔔、跳來跳去，還有破解謎題……應該吧。",
         "立啪被變成馬之後的樣子。會如此移動：{1x2move.webp}",
         "立啪被變成駱駝之後的樣子。會如此移動：{1x3move.webp}",
         "立啪被變成象之後的樣子。會如此移動：{2x2move.webp}",
         "瀚漠是隻嚴肅而勤奮的駱駝。瀚漠以前曾經因為太餓，就在未經同意下吃了一些蘿蔔。作為代價，他必須為那些蘿蔔的主人工作，但他不抱怨，並盡可能拿出最好的表現。",
         "奡飛是隻有點懶又有點傻的大象。他之所以為他老闆工作，是因為他需要一個工作，卻找不到別的。奡飛一直想要領更高的薪水，但他工作時都只會最低限度的努力。他被炒了大概也不奇怪……",
         "此為蘿蔔田的主人，以及瀚漠和奡飛的老闆。他是個又老脾氣又不好的高等巫師，還建造了一座巨大的地下迷宮。他一直招募新員工來為他工作，然而沒人知道他的目的……還有他迷宮的解答。"],
        ["立啪是只富有好奇心又顽皮的兔子，同时也是地方巫师学校的学生。虽然是巫师，魔法却很烂，烂到连最基本的魔法课程都被当了3次。不过，立啪很擅长吃萝卜、跳来跳去，还有破解谜题……应该吧。",
         "立啪被变成马之后的样子。会如此移动：{1x2move.webp}",
         "立啪被变成骆驼之后的样子。会如此移动：{1x3move.webp}",
         "立啪被变成象之后的样子。会如此移动：{2x2move.webp}",
         "瀚漠是只严肃而勤奋的骆驼。瀚漠以前曾经因为太饿，就在未经同意下吃了一些萝卜。作为代价，他必须为那些萝卜的主人工作，但他不抱怨，并尽可能拿出最好的表现。",
         "奡飞是只有点懒又有点傻的大象。他之所以为他老板工作，是因为他需要一个工作，却找不到别的。奡飞一直想要领更高的薪水，但他工作时都只会最低限度的努力。他被炒了大概也不奇怪……",
         "此为萝卜田的主人，以及瀚漠和奡飞的老板。他是个又老脾气又不好的高等巫师，还建造了一座巨大的地下迷宫。他一直招募新员工来为他工作，然而没人知道他的目的……还有他迷宫的解答。"],
         ["地元の魔法学校に通う、好奇心旺盛でいたずら好きなウサギ。魔法使いなのに魔法が本当に苦手で、一番基礎的な魔法の授業に3回も落第しちゃったほど。しかし、ニンジンを食べること、跳ね回ること、そしてパズルを解くことは得意……多分。",
         "ウマに変えられたリーッパ。その動きは：{1x2move.webp}",
         "ラクダに変えられたリーッパ。その動きは：{1x3move.webp}",
         "ゾウに変えられたリーッパ。その動きは：{2x2move.webp}",
         "真面目で勤勉なラクダ。昔、空腹に耐えきれず、許可なくニンジンを食べてしまったことがある。その償いとして、ハンメルはそのニンジンの持ち主のもとで働くことになったが、文句ひとつ言わず、与えられた仕事に全力で取り組んでいる。",
         "ちょっと怠け者で、おっちょこちょいなゾウ。アルフィルは、仕事が必要だったものの他に選べる職がなかったため、今の上司のもとで働いている。最低限の努力しかしないくせに、いつも「もっと給料が欲しい」と言っている。このままでは首になっても、全然不思議ではない……。",
         "ニンジン畑の持ち主で、ハンメルとアルフィルの上司だ。年老いて不機嫌そうな彼は、上級魔法使いで、巨大な地下迷宮を作り上げた。彼は常に新しい従業員を雇っているが、彼の目的は誰にも理解されていない……そして、その迷宮の解答も。"]
    ],
    "navbarTexts": [
        {"home": "Top", "introduction": "Introduction", "language": "Language"},
        {"home": "頂端", "introduction": "介紹", "language": "語言"},
        {"home": "顶端", "introduction": "介绍", "language": "语言"},
        {"home": "先頭", "introduction": "紹介", "language": "言語"}
    ],
    "links": {
        "steam": "https://store.steampowered.com/app/3529380/Carrotour/",
        "discord": "https://discord.gg/T8aKvA57am",
        "youtube": "https://www.youtube.com/@Carrotour",
        "twitter": "https://x.com/Carrotour"
    }
}
